InformationRegisters/СостоянияВыгрузкиВЦентрЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВыгрузкиВЦентрЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовВыгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовОсталось</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияВыгрузкиВЦентрЭДО/Ext/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЭДО - см. РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.ИдентификаторЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * ДатаНачала - Дата
//  * ДатаЗавершения - Дата
//  * ДокументовВыгружено - Число
//  * ДокументовОсталось - Число
//  * Прогресс - Число
//  * ОсталосьВремени - Строка
Функция СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО) Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("ДатаНачала", '00010101');
	Состояние.Вставить("ДатаЗавершения", '00010101');
	Состояние.Вставить("ДокументовВыгружено", 0);
	Состояние.Вставить("ДокументовОсталось", 0);
	Состояние.Вставить("Прогресс", 0);
	Состояние.Вставить("ОсталосьВремени", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияПереходаВЦентрЭДО.ДатаНачала КАК ДатаНачала,
		|	СостоянияПереходаВЦентрЭДО.ДатаЗавершения КАК ДатаЗавершения,
		|	СостоянияПереходаВЦентрЭДО.ДокументовВыгружено КАК ДокументовВыгружено,
		|	СостоянияПереходаВЦентрЭДО.ДокументовОсталось КАК ДокументовОсталось
		|ИЗ
		|	РегистрСведений.СостоянияВыгрузкиВЦентрЭДО КАК СостоянияПереходаВЦентрЭДО
		|ГДЕ
		|	СостоянияПереходаВЦентрЭДО.ИдентификаторЭДО = &ИдентификаторЭДО";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Состояние;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Состояние, Выборка);
	
	Если ЗначениеЗаполнено(Состояние.ДатаЗавершения) Тогда
		Состояние.Прогресс = 100;
		Возврат Состояние;
	КонецЕсли;
	
	Если Состояние.ДокументовВыгружено = 0 Тогда
		Состояние.ОсталосьВремени = НСтр("ru = 'Рассчитывается...'");
		Возврат Состояние;
	КонецЕсли;
	
	Если Состояние.ДокументовВыгружено > 0 Тогда
		Состояние.Прогресс = Окр(Состояние.ДокументовВыгружено * 100 / 
			(Состояние.ДокументовОсталось + Состояние.ДокументовВыгружено));
	КонецЕсли;
	
	ОставшеесяВремя = (ТекущаяДатаСеанса() - Состояние.ДатаНачала) / 
		Состояние.ДокументовВыгружено * Состояние.ДокументовОсталось;
	
	Если ОставшеесяВремя = 0 Тогда
		Состояние.ОсталосьВремени = "";
	ИначеЕсли ОставшеесяВремя <= 180 Тогда
		Состояние.ОсталосьВремени = НСтр("ru = 'Несколько минут'");
	ИначеЕсли ОставшеесяВремя <= 3600 Тогда
		Состояние.ОсталосьВремени = СтрШаблон(НСтр("ru = '~ %1 мин.'"), Окр(ОставшеесяВремя / 60));
	Иначе
		Состояние.ОсталосьВремени = СтрШаблон(НСтр("ru = '~ %1 ч.'"), Окр(ОставшеесяВремя / 3600, 1));
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторЭДО - Строка
//  * ДатаНачала - Неопределено,Дата
//  * ДатаЗавершенияРегистрации - Неопределено,Дата
//  * ДатаЗавершения - Неопределено,Дата
//  * ДокументовВыгружено - Неопределено,Число
//  * ДокументовОсталось - Неопределено,Число
Функция НовоеИзменениеСостояния() Экспорт
	
	ИзменениеСостояния = Новый Структура;
	ИзменениеСостояния.Вставить("ИдентификаторЭДО", "");
	ИзменениеСостояния.Вставить("ДатаНачала", Неопределено);
	ИзменениеСостояния.Вставить("ДатаЗавершенияРегистрации", Неопределено);
	ИзменениеСостояния.Вставить("ДатаЗавершения", Неопределено);
	ИзменениеСостояния.Вставить("ДокументовВыгружено", Неопределено);
	ИзменениеСостояния.Вставить("ДокументовОсталось", Неопределено);
	Возврат ИзменениеСостояния;
	
КонецФункции

// Параметры:
//  ИзменениеСостояния - см. НовоеИзменениеСостояния
Процедура Обновить(ИзменениеСостояния) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИзменениеСостояния.ИдентификаторЭДО);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		ЗаписьНабора = НаборЗаписей[0];
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаписьНабора.ИдентификаторЭДО = ИзменениеСостояния.ИдентификаторЭДО;
	
	Если ИзменениеСостояния.ДатаНачала <> Неопределено Тогда
		ЗаписьНабора.ДатаНачала = ИзменениеСостояния.ДатаНачала;
	КонецЕсли;
	
	Если ИзменениеСостояния.ДатаЗавершенияРегистрации <> Неопределено Тогда
		ЗаписьНабора.ДатаЗавершенияРегистрации = ИзменениеСостояния.ДатаЗавершенияРегистрации;
	КонецЕсли;
	
	Если ИзменениеСостояния.ДатаЗавершения <> Неопределено Тогда
		ЗаписьНабора.ДатаЗавершения = ИзменениеСостояния.ДатаЗавершения;
	КонецЕсли;
	
	Если ИзменениеСостояния.ДокументовВыгружено <> Неопределено Тогда
		ЗаписьНабора.ДокументовВыгружено = ЗаписьНабора.ДокументовВыгружено + ИзменениеСостояния.ДокументовВыгружено;
		ДокументовОсталось = ЗаписьНабора.ДокументовОсталось - ИзменениеСостояния.ДокументовВыгружено;
		ЗаписьНабора.ДокументовОсталось = ?(ДокументовОсталось > 0, ДокументовОсталось, 0);
	КонецЕсли;
	
	Если ИзменениеСостояния.ДокументовОсталось <> Неопределено Тогда
		ЗаписьНабора.ДокументовОсталось = ЗаписьНабора.ДокументовОсталось + ИзменениеСостояния.ДокументовОсталось;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
